{
  "Id": "rJHqDwAAQBAJ",
  "Title": "The Secret Life of Cows",
  "Authors": [
    "Rosamund Young"
  ],
  "Description": "<b><b>\"Within a day of receiving this book, I had consumed it... Absorbing, moving, and compulsively readable.\"—Lydia Davis</b><br><br><b>In this affectionate, heart-warming chronicle, Rosamund Young distills a lifetime of organic farming wisdom, describing the surprising personalities of her cows and other animals</b></b><br><br>At her famous Kite's Nest Farm in Worcestershire, England, the cows (as well as sheep, hens, and pigs) all roam free. They make their own choices about rearing, grazing, and housing. Left to be themselves, the cows exhibit temperaments and interests as diverse as our own. \"Fat Hat\" prefers men to women; \"Chippy Minton\" refuses to sleep with muddy legs and always reports to the barn for grooming before bed; \"Jake\" has a thing for sniffing the carbon monoxide fumes of the Land Rover exhaust pipe; and \"Gemima\" greets all humans with an angry shake of the head and is fiercely independent.<br><br>An organic farmer for decades, Young has an unaffected and homely voice. Her prose brims with genuine devotion to the wellbeing of animals. Most of us never apprehend the various inner lives animals possess, least of all those that we might eat. But Young has spent countless hours observing how these creatures love, play games, and form life-long friendships. She imparts hard-won wisdom about the both moral and real-world benefits of organic farming. (If preserving the dignity of animals isn't a good enough reason for you, consider how badly factory farming stunts the growth of animals, producing unhealthy and tasteless food.)<br><br>This gorgeously-illustrated book, which includes an original introduction by the legendary British playwright Alan Bennett, is the summation of a life's work, and a delightful and moving tribute to the deep richness of animal sentience.",
  "SelfLink": "https://www.googleapis.com/books/v1/volumes/rJHqDwAAQBAJ"
}